Duet3D/Duet3Expansion/src/atmel/SAMD20_DFP/1.2.91/samd20b/atdf/ATSAMD20G15B.atdf
        <register name="BAUD" offset="0xA" rw="RW" size="2" initval="0x0000" caption="USART Baud">
          <bitfield name="BAUD" caption="Baud Value" mask="0xFFFF"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="USART Interrupt Enable Clear">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Enable" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
          <bitfield name="RXS" caption="Receive Start Interrupt Disable" mask="0x8"/>
        </register>
        <register name="INTENSET" offset="0xD" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="USART Interrupt Enable Set">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Enable" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
          <bitfield name="RXS" caption="Receive Start Interrupt Enable" mask="0x8"/>
        </register>
        <register name="INTFLAG" offset="0xE" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="USART Interrupt Flag Status and Clear">
          <bitfield name="DRE" caption="Data Register Empty" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete" mask="0x4"/>
          <bitfield name="RXS" caption="Receive Start Interrupt" mask="0x8"/>
        </register>
        <register name="STATUS" offset="0x10" rw="RW" size="2" initval="0x0000" caption="USART Status">
          <bitfield name="PERR" caption="Parity Error" mask="0x1"/>
          <bitfield name="FERR" caption="Frame Error" mask="0x2"/>
          <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
          <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x8000"/>
        </register>
        <register name="DATA" offset="0x18" rw="RW" size="2" initval="0x0000" caption="USART Data">
          <bitfield name="DATA" caption="Data" mask="0x1FF"/>
        </register>
      </register-group>
      <value-group name="SERCOM_I2CM_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART mode with external clock" value="0"/>
        <value name="USART_INT_CLK" caption="USART mode with internal clock" value="1"/>
        <value name="SPI_SLAVE" caption="SPI mode with external clock" value="2"/>
        <value name="SPI_MASTER" caption="SPI mode with internal clock" value="3"/>
        <value name="I2C_SLAVE" caption="I2C mode with external clock" value="4"/>
        <value name="I2C_MASTER" caption="I2C mode with internal clock" value="5"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART mode with external clock" value="0"/>
        <value name="USART_INT_CLK" caption="USART mode with internal clock" value="1"/>
        <value name="SPI_SLAVE" caption="SPI mode with external clock" value="2"/>
        <value name="SPI_MASTER" caption="SPI mode with internal clock" value="3"/>
        <value name="I2C_SLAVE" caption="I2C mode with external clock" value="4"/>
        <value name="I2C_MASTER" caption="I2C mode with internal clock" value="5"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLA__SDAHOLD">
        <value name="DIS" caption="Disabled" value="0"/>
        <value name="75" caption="50-100 ns hold time" value="1"/>
        <value name="450" caption="300-600 ns hold time" value="2"/>
        <value name="600" caption="400-800 ns hold time" value="3"/>
      </value-group>
      <value-group name="SERCOM_SPI_CTRLA__FORM">
        <value name="SPI" caption="SPI frame" value="0"/>
        <value name="SPI_ADDR" caption="SPI frame with address" value="2"/>
      </value-group>
      <value-group name="SERCOM_SPI_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART mode with external clock" value="0"/>
        <value name="USART_INT_CLK" caption="USART mode with internal clock" value="1"/>
        <value name="SPI_SLAVE" caption="SPI mode with external clock" value="2"/>
        <value name="SPI_MASTER" caption="SPI mode with internal clock" value="3"/>
        <value name="I2C_SLAVE" caption="I2C mode with external clock" value="4"/>
        <value name="I2C_MASTER" caption="I2C mode with internal clock" value="5"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__FORM">
        <value name="0" caption="USART frame" value="0"/>
        <value name="1" caption="USART frame with parity" value="1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART mode with external clock" value="0"/>
        <value name="USART_INT_CLK" caption="USART mode with internal clock" value="1"/>
        <value name="SPI_SLAVE" caption="SPI mode with external clock" value="2"/>
        <value name="SPI_MASTER" caption="SPI mode with internal clock" value="3"/>
        <value name="I2C_SLAVE" caption="I2C mode with external clock" value="4"/>
        <value name="I2C_MASTER" caption="I2C mode with internal clock" value="5"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__RXPO">
        <value name="PAD0" caption="SERCOM_PAD0" value="0"/>
        <value name="PAD1" caption="SERCOM_PAD1" value="1"/>
        <value name="PAD2" caption="SERCOM_PAD2" value="2"/>
        <value name="PAD3" caption="SERCOM_PAD3" value="3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__TXPO">
        <value name="PAD0" caption="TXD at PAD0, XCK at PAD1" value="0"/>
        <value name="PAD2" caption="TXD at PAD2, XCK at PAD3" value="1"/>
      </value-group>
      <value-group name="SERCOM_SPI_CTRLB__AMODE">
        <value name="MASK" caption="ADDRMASK is used as a mask to the ADDR register." value="0"/>
        <value name="2ADDR" caption="The slave responds to the 2 unique addresses in ADDR and ADDRMASK." value="1"/>
        <value name="RANGE" caption="The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit." value="2"/>
      </value-group>
    </module>
    <module name="SYSCTRL" id="U2100" version="2.0.1" caption="System Control">
      <register-group name="SYSCTRL" caption="System Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
          <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
        </register>
